{"posts":[{"title":"About Project Management","text":"StrategyAgile VS traditional PMBalanc of Technical and Sociocultural DimensionsOrganization and ScopeMatrix StructuresProject Management Offices(PMOs)Organizational CultureCost and Time EstimationIs a trade-off, balancing the benefits of better accuracy against the costs of secured increased accuracy. Types of EstimatesTop-down (macro) estimates Analogy Group consensus Mathematical relationships Bottom-up (micro) estimates based on estimates of elements found in the work breakdown structure Why Estimating Time and Cost Is Important To support good decisions. To schedule work. To determine how long the project should take and its cost. To determine whether the project is worth doing. To develop cash flow needs. To determine how well the project is progressing. different aspects of estimating Range Accuracy Precision Confidence Factors Influencing the Quality of Estimates Planning Horizon: cost estimates for a party you are organizing this weekend should be much more accurate than the estimates for a party that will take place in six months. Project Complexity People: How familiar are they with the task they are estimating? Project Structure and Organization: In a matrix environment may take longer, since attention is divided and coordination demands. Padding Estimates: Most of us are inclined to add a little padding to reduce the risk of being late Organizational Culture Others: Equipment downtime, National holidays, vacations, etc. Estimating Guidelines for Times, Costs, and Resources Responsibility: estimates should be made by the person(s) most familiar with the task. The use of several people to estimate: leads to consensus and eliminate extreme estimate errors Normal conditions: based on certain assumptions. Estimates should be based on normal conditions, efficient methods, and a normal level of resources Time units: All task time estimates need consistent time units. Eg: calendar days, workdays, workweeks, person days, single shift, hours, minutes, etc. Independence: treat each task as independent of other tasks. To avoid some rough “guesstimate” of the total time for the whole path Contingencies: Work package estimates should not include allowances for contingencies. Risk assessment: to avoid surprises to stakeholders. Simply identifying the degree of risk Top-Down versus Bottom-Up EstimatingTop-Down Estimates Are usually derived from someone who uses experience and/or information to determine the project duration and total cost. Are sometimes made by top managers who have very little knowledge of the component activities used to complete the project. Bottom-Up Estimates Can take place after the project has been defined in detail. Can serve as a check on cost elements in the WBS by rolling up the work packages and associated cost accounts to major deliverables. Provide the customer with an opportunity to see various trade-offs in different project scenarios, such as time, cost, resources, and technical performance. The Preferred Approach in Defining the Project Make rough top-down estimates Develop the WBS/OBS Make bottom-up estimates Develop schedules and budgets Reconcile differences between top-down and bottom-up estimates Methods for Estimating Project Times and CostsTop-Down Approaches Consensus Method: use experience of senior and/or middle managers to estimate Ratio Method: use number of square feet to estimate the cost and time to build a house Apportion Method: an extension to the ratio method. Foundation might represent 3% of the total loan, framing 25%, plumbing and heating 15%, etc. Function Point Methods for Software and System Projects: using a regression formula derived from data of past projects Learning Curves: The time to perform a task improves with repetition Bottom-Up Approaches Template Method: If the project is similar to past projects. Parametric Procedures Applied to Specific Tasks: a cost of $7 per square yard of wallpaper. Range Estimating: Require three time estimates—low, average, and high (probability distributions). Get risk level from (high - low) A Hybrid: Phase Estimating Level of DetailA frequent rule of thumb used by practicing project managers says that a task duration should not exceed 5 workdays or at the most 10 workdays, if workdays are the time units used for the project. Types of Costs Direct costs Labor Materials Equipment Other Direct project overhead costs salary of the project manager temporary rental space for the project team supplies specialized machinery General and administrative (G&amp;A) overhead costs Advertising accounting salary of senior management above the project level Refining EstimatesReasons for adjusting estimates Interaction costs are hidden in estimates: each task estimate is supposed to be done independently. However, tasks are rarely completed in a vacuum. Normal conditions do not apply: availability of resources. Resource shortages, whether in the form of people, equipment, or materials. Things go wrong on projects: extreme weather conditions occur, accidents happen Project scope and plans change. People are overly optimistic. People engage in strategic misrepresentation: promoters underestimate the costs of projects and overestimate project benefits in order to win approval. Creating a Database for EstimatingCollect and archive data on past project estimates and actuals Mega Projects: A Special CaseA “white elephant” suggests a valuable, but burdensome, possession, which its owner cannot easily dispose of and whose cost (particularly upkeep) is out of proportion with its usefulness. The Reference Class Forecasting (RCF)Three Major Steps: Select a reference class of projects similar to your potential project. Collect and arrange outcome data as a distribution. Create a distribution of cost overruns as a percentage of the original project estimate (low to high). Use the distribution data to arrive at a realistic forecast. Compare the original cost estimate for the project with the reference class projects Benefits: Outside empirical data mitigates human bias. Politics, strategic, and promoter forces have difficulty ignoring outside RCF information. RCF serves as a reality check for funding large projects. RCF helps executives avoid unsound optimism. RCF leads to improved accountability. RCF provides a basis for project contingency funds. Developing a Project Schedule","link":"/blog/2024/10/24/About-Project-Management/"},{"title":"Chrome Extension","text":"Chrome Extension manifest.json build parcel request https aws load balance","link":"/blog/2024/10/20/Chrome-Extension/"},{"title":"Hello LLMs","text":"tech stack language: js python js should use inference API instead of transforms.js platform: huggingface ollama model: llama deployfrontend auto to aws aws IAM Creat user and grant the 3S full access creat a access key github repository secrets for actions backend to ec2 EC2 Amazon Linux use yum to install git &amp; python pip install -r requirements.txt huggingface-cli login security group &gt; Inbound rules DB mongoDB dotenv keep link safe access ip whitelist","link":"/blog/2024/10/17/hello-llm/"},{"title":"Post Your Blog Automaticly","text":"How to use Hexo post your blog automaticly? What is Hexo?auto? What is Github pagesWhat is Github Actions?token: $","link":"/blog/2024/09/16/post-ur-blog-automaticly/"}],"tags":[],"categories":[],"pages":[]}